In [1]:
import pandas as pd

In [2]:
arr = [1,2,3,4,5,6]
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
pd.Series([1,2,3,4,5,6],index = [1,2,3,4,5,6])

1    1
2    2
3    3
4    4
5    5
6    6
dtype: int64

In [4]:
arr[1]

2

name can be used to give name to the series

In [7]:
pd.Series([1,2,3,4,5,6],index = [1,2,3,4,5,6], name = 'Amar')

1    1
2    2
3    3
4    4
5    5
6    6
Name: Amar, dtype: int64

In [21]:
series = pd.Series({'a':1, 'b':2, 'c':3})
series#9696449908

a    1
b    2
c    3
dtype: int64

In [22]:
series[0:2]

a    1
b    2
dtype: int64

In [23]:
max(series)

3

DataFrame()

In [26]:
arr = [[1,2,3],[4,5,6]]
new = pd.DataFrame(arr[0])
new

   0
0  1
1  2
2  3

In [27]:
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6

using dictionary,each key represented column frame

In [28]:
new2 = pd.DataFrame([{'a':1, 'b':2, 'c':3},{'a':4, 'b':5, 'c':6}])
new2

   a  b  c
0  1  2  3
1  4  5  6

DataFrame using Series

In [29]:
new3 = pd.DataFrame({'Rollno':pd.Series([1,2,3,4,5,6]),'Mark':([45,55,60,62,50,56])})
new3

   Rollno  Mark
0       1    45
1       2    55
2       3    60
3       4    62
4       5    50
5       6    56

head() gives first 5row and tail() gives last 5row

In [30]:
new3.head()

   Rollno  Mark
0       1    45
1       2    55
2       3    60
3       4    62
4       5    50

In [32]:
new3.head(2)

   Rollno  Mark
0       1    45
1       2    55

In [33]:
new3.tail()

   Rollno  Mark
1       2    55
2       3    60
3       4    62
4       5    50
5       6    56

In [35]:
new3.tail(2)

   Rollno  Mark
4       5    50
5       6    56

describe() gives descreption of numerical data

In [38]:
new3.describe()

         Rollno       Mark
count  6.000000   6.000000
mean   3.500000  54.666667
std    1.870829   6.314006
min    1.000000  45.000000
25%    2.250000  51.250000
50%    3.500000  55.500000
75%    4.750000  59.000000
max    6.000000  62.000000

info() gives the basic information of dataFrame

In [39]:
new3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rollno  6 non-null      int64
 1   Mark    6 non-null      int64
dtypes: int64(2)
memory usage: 224.0 bytes

shape gives row and cols of data frame size gives number the cell in data frame

In [40]:
new3.shape

(6, 2)

In [41]:
new3.size

12

isnull() returns true if data contains null value

In [42]:
new3.isnull()

   Rollno   Mark
0   False  False
1   False  False
2   False  False
3   False  False
4   False  False
5   False  False

isnull() sum() will return number of null values in each columns isnull().sum().sum() will return total null values in data frame

In [43]:
new3.isnull().sum()

Rollno    0
Mark      0
dtype: int64

In [44]:
new3.isnull().sum().sum()

0

If data contains null values, we can drop the rows/cols containing null values using dropna() By default axis == 0 in dropna() If we intend to drop cols, we can use axis = 1 We can also use "how" as follows dropna(how = 'any") work same as dropna() dropna(how = 'all') will drop the row only if all the values in that row are null

In [49]:

new3.dropna()

   Rollno  Mark
0       1    45
1       2    55
2       3    60
3       4    62
4       5    50
5       6    56

fillna(value) will replace all the null values with values passed the function

In [57]:
new3.fillna(0)

   Rollno  Mark
0       1    45
1       2    55
2       3    60
3       4    62
4       5    50
5       6    56

We can also use dictionary to rerplace null like new3.fillna(('Rollnumber: 3, "Marks" 'none')) will replace null with 3 in Rollnumber column and with none in Marks columns

In [58]:
new3.fillna({'Rollno':3, 'Marks':'none'})

   Rollno  Mark
0       1    45
1       2    55
2       3    60
3       4    62
4       5    50
5       6    56

fillna(method="fill") will fill null values with previous rows same column value if we do fillna(method='ffill, axis=1) will fill null values with previous column's same row value

In [60]:
new3.fillna(method = 'ffill')

   Rollno  Mark
0       1    45
1       2    55
2       3    60
3       4    62
4       5    50
5       6    56

replace(to replace=None, value=None, inplace=None, limit=None, regex=False, method="pad") "to replace" value will get replaced by "value"

In [62]:
new3.replace(44,45)

   Rollno  Mark
0       1    45
1       2    55
2       3    60
3       4    62
4       5    50
5       6    56

In [63]:
new3.replace([12,48,35],44)

   Rollno  Mark
0       1    45
1       2    55
2       3    60
3       4    62
4       5    50
5       6    56